// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
let arr1 = [1, 2, 3];
let arr2 = [4, 5, 6];
let arr3 = arr1.concat(arr2);
console.log('zad 1: ' + arr3);

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
arr1.reverse();
console.log('zad 2: ' + arr1);

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
arr1 = [1, 2, 3];
arr1.push(4, 5, 6);
console.log('zad 3: ' + arr1);

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
arr1 = [1, 2, 3];
arr1.unshift(4, 5, 6);
console.log('zad 4: ' + arr1);

// 5. Дан массив [‘js’, ‘css’, ‘jq’]. Выведите на экран первый элемент.
arr1 = ['js', 'css', 'jq'];
console.log('zad 5: ' + arr1[0]);

// 6. Дан массив [‘js’, ‘css’, ‘jq’]. Выведите на экран последний элемент.
console.log('zad 6: ' + arr1[arr1.length-1]);

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].
arr1 = [1, 2, 3, 4, 5];
arr2 = arr1.slice(0, 3);
console.log('zad 7: ' + arr2);

// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
arr2 = arr1.slice(-2);
console.log('zad 8: ' + arr2);

// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
arr1.splice(1, 2);
console.log('zad 9: ' + arr1);

// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
arr1 = [1, 2, 3, 4, 5];
arr2 = arr1.slice(1, 4);
console.log('zad 10: ' + arr2);

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, ‘a’, ‘b’, ‘c’, 4, 5].
arr1.splice(3, 0, 'a', 'b', 'c');
console.log('zad 11: ' + arr1);

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, ‘a’, ‘b’, 2, 3, 4, ‘c’, 5, ‘e’].
arr1 = [1, 2, 3, 4, 5];
arr1.splice(1, 0, 'a', 'b');
arr1.splice(6, 0, 'c');
arr1.splice(8, 0, 'e');
console.log('zad 12: ' + arr1);

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
arr1 = [3, 4, 1, 2, 7];
arr1.sort();
console.log('zad 13: ' + arr1);

// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
arr1 = [5, 6, 7, 8, 9];
let summ = arr1.reduce((sum, current) => sum + current, 0)
console.log('zad 14: ' + summ);

// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
arr1 = [5, 6, 7, 8, 9];
arr2 = arr1.map(el => el ** 2);
console.log('zad 15: ' + arr2);

// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
arr1 = [1,-3, 5, 6,-7, 8, 9,-11];
arr2 = arr1.filter(el => el < 0);
arr1.splice(0, arr1.length, arr2)
console.log('zad 16: ' + arr1);

// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
arr1 = [1,-3, 5, 6,-7, 8, 9,-11];
arr2 = arr1.filter(el => (el % 2) === 0);
arr1.splice(0, arr1.length, arr2)
console.log('zad 17: ' + arr1);

// 18. Дан массив со строками [‘aaa’, ‘aaaqqq’, ‘zzzqq’, ‘zz’, ‘qsaa’, ‘q’, ‘az’]. Оставьте в нем только те строки, длина которых больше 5-ти символов.
arr1 = ['aaa', 'aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q', 'az'];
arr2 = arr1.filter(el => el.length > 5);
arr1.splice(0, arr1.length, arr2)
console.log('zad 18: ' + arr1);

// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
arr1 = [1, 2, [3, 4], 5, [6, 7]];
arr2 = arr1.filter(el =>Array.isArray(el));
arr1.splice(0, arr1.length);
arr2.forEach(el => arr1.push(el));
console.log('zad 19: ' + arr1);

// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
arr1 = [5,-3, 6,-5, 0,-7, 8, 9];
summ = (arr1.filter(el => el < 0)).reduce((sum, current) => sum + current, 0);
console.log('zad 20: ' + summ);